package com.cyjh.elfin.ui.view.customview.loadwidget.swiperefresh;

import android.content.Context;
import android.os.Build;
import android.util.AttributeSet;
import android.widget.AbsListView;
import androidx.core.view.ViewCompat;

/* JADX INFO: loaded from: classes.dex */
public abstract class ReHeadDefaultSwipeRefreshLayout<T> extends ReDefaultSwipeRefreshLayout {
    public ReHeadDefaultSwipeRefreshLayout(Context context, AttributeSet attributeSet) {
        super(context, attributeSet);
    }

    @Override // androidx.swiperefreshlayout.widget.SwipeRefreshLayout
    public boolean canChildScrollUp() {
        BaseListView baseListView = null;
        String str = "ۨۥۧۙۥۙۡۢ۬ۧۖۗۛۤۦ۬۟ۚۜۤۡ۟ۦۙۖۨ۬ۥ۟ۘۘ۠ۦۢۤ۬ۧ۠ۘ۬ۧ۬ۨ۟۬ۖۚۖ۬";
        boolean z = false;
        boolean z3 = false;
        boolean z4 = false;
        boolean z5 = false;
        boolean z6 = false;
        while (true) {
            switch ((((str.hashCode() ^ 55) ^ 103) ^ 536) ^ (-1149004368)) {
                case -2128660327:
                    z6 = baseListView instanceof AbsListView;
                    str = "ۨۧۨۘ۬ۤۖۚۢۗ۬ۡۨۖ۠ۥۘۤۙۜۘۘۢۥۘ۟ۚۡۨۗ۠ۧۡۥۘ۟ۦۧۜ۠ۦۘۖۦۜۨۙۦۡ۬۬ۥۙ";
                    break;
                case -1837624708:
                    str = "ۥۖۖۦۥۨۘ۟۫ۢۗۤۥۘۖ۬ۦۜۨۛۛۖۦ۫۬ۧۙ۠ۖۘۗۘۥۢۦۘۙۖ۠ۚۥۜۨ۠ۧۛ۠ۜۘۨۡۘۧ۫ۦۘ۠ۙۚ";
                    z = false;
                    break;
                case -1699740768:
                    str = "ۖ۠ۖۘۧۖۦۢۤۡۛۙۗۘۜۤۛۡۗۖ۟ۘۘ۠ۡۖۘۨۨۨۘۧۥۦ";
                    z3 = z4;
                    break;
                case -1696366892:
                    str = "ۗۙۖ۠ۖۨۘۛۙۧۜۖۜۙ۫ۦۘۜ۬ۦۘۙۙۦۙۖۡۚۜ۬ۨۡ۟۟ۤۨۘ۬ۛۛۚۦۥۘ۟۠ۡ";
                    z5 = true;
                    break;
                case -1637516302:
                    String str2 = "ۚۡۗۡۥۗ۟ۦۚۧۖۧۘۘۦۨۦۛۤۙۡۨۘ۠ۖۥۘۢۖۤۦۘۛ۟ۤۢۦ۟ۢۜۥ۠ۚۧۨ۟ۡۧ۬ۡ";
                    while (true) {
                        switch (str2.hashCode() ^ 1667542674) {
                            case -2113785831:
                                String str3 = "ۙۡۘۘۜۡۥۘۗۧۤۤۢۚۦ۠ۡ۟۬ۨ۫ۤۦۘۖۖۜۘۙ۠ۡۙۙۨۘ۟ۧۦ۟ۥۢۡ۫ۖۘۘۘۧۘۧۘ۠ۖۧۘۧۚ۠ۡۗۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-356276452)) {
                                        case -1415921125:
                                            str2 = "۟ۧۚۚ۠ۨۘۧۥۖۘۢۖۖۘۘۧۧۤۜ۟ۖۚۥۘ۟ۥۚۡ۬ۘۛۜۙۥۥۘۘۤۧۥۘۜۚۦۙۥۥۘۚۨۘۢۦۗ";
                                            break;
                                        case -598624813:
                                            str3 = z6 ? "ۘۦۢۛ۫ۡۛۢۜۤ۠ۨۘۛۢۡۘۡ۫ۨۚ۟ۢ۬ۜۘۗۨۦۘۢۢۗۗۙۥۛۡ۠ۗۨ۬۬۟ۡۡۜۘۥ۫ۚ" : "۠ۘ۫۟ۘۜۚۤ۟۫ۗ۟ۚۘۚ۫ۙۡۘۥۘۚۤ۟ۚۤۦۨۘۢۥۘ";
                                            break;
                                        case 608306628:
                                            str2 = "۬ۗ۫ۡ۟ۡۘۚۗ۟۟ۦۦۘۧ۬ۥۥۦۦۘۢۗۖ۠ۚ۫ۖۢۢۛۛۧۘ۫ۜۥۥۜۛۥۤۦ۬ۧۦۢۡۘۘۚ۠";
                                            break;
                                        case 863770194:
                                            str3 = "ۨۥۙۚۚ۠ۗۧۚۚۤۗ۫ۤ۟ۤۜۦۤۘۜۘۜۢۜۘۨ۬ۜۙۢۜۖۜۦۜۧۖ";
                                            break;
                                    }
                                }
                                break;
                            case -1031145166:
                                str = "ۡۡۛۚۖۙۚۜۥۡۥ۬ۡۙۜۘۨۧۜ۫ۦۨۜۜ۫ۢ۫ۨۤۗ۠ۘۢۙۗۡۜۘ۠ۚۡۘ۬۬ۗۥۙۥۘۥۦ۠۟۬ۛۦۦ";
                                continue;
                            case -859937327:
                                str = "ۤۡ۫ۤۦۨۘۗۢۢۗۘۧ۬۟ۗۧ۫ۖۘۚۦۧۜۨۤۜۥۗ۠ۜ۟ۡۢ۟۫ۖۘۘ";
                                continue;
                            case -81882003:
                                str2 = "ۥۛۖ۠۫ۤ۟ۜۜۛۧ۬ۧ۠ۧۨۥ۬ۥ۠ۡۖۡۥۤۢۜۨۜۖۖۨۨۜۡ۠ۥۡۘۘۤۡۘۖۗۡۧۦۜ۠ۚۦۚۘۦ";
                                break;
                        }
                    }
                    break;
                case -1448842172:
                    String str4 = "ۨ۠ۦۘۜۨۧۜ۫ۧۨۜۡۘۜۧۚۦۥۦۖۚۡۙ۫ۨۘۚۗ۫ۛۖۖ";
                    while (true) {
                        switch (str4.hashCode() ^ (-76073741)) {
                            case -1802482603:
                                break;
                            case -1600856559:
                                String str5 = "ۤۜ۠ۥۚ۠ۨۘۡۘۛۦ۬ۢۡ۠ۚ۟ۖۙۡۡۗۖۤۖۤۨۘۨۙ۟ۚۨۦ۟ۡۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-756954632)) {
                                        case -1891625056:
                                            str5 = "ۧۡۘۘۙۖ۫۠۫ۙۢ۟ۦۘ۠ۚۥۗۗ۟ۗ۫ۧۜۛۖۨۤ۠ۥۚۢۚ۟۬ۙۨۜۘ";
                                            break;
                                        case -334606365:
                                            str5 = baseListView.getChildAt(0).getTop() < baseListView.getPaddingTop() ? "ۜ۟ۗۨۗۦۘ۫ۡۛۙۘۧۡۧ۠ۢۦۢۘۦ۫۠ۤۖۘۤ۬ۡۦۦۢۨۘۢۦۜ" : "ۚۨۥۘۢۤۚۖۥ۠ۡۖۥۘۚ۫ۖۧ۫۫ۦۙۥۛۛۨۢۜۖۘۛ۬ۧ۟۬ۜۘ۬ۧۚ";
                                            break;
                                        case -301914192:
                                            str4 = "ۤۛۡۗۚۡۘۦۘۡۘۨۗ۟۠۫ۚ۫۫ۨۥ۟ۘۢ۬ۖۘۘۦۗ۠۫ۢۖۜۢۘ۫ۡ";
                                            break;
                                        case 521555534:
                                            str4 = "ۦۢۘ۫ۗۥ۫ۤ۬۟ۚۤۘۨۧۘۧۥۥۘۡۙۖ۠ۗۥۘۗۛۖۘۛۥۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case -181505603:
                                str4 = "ۤۙۘۨ۬۫۬۟ۜۛۙ۬ۘۨ۫ۢۜۡۘۢ۫ۜۛۤ۫ۙ۫ۦۘۢۨۦ۬ۡۧ۬ۜۥۘۢ۫ۖۘ۟ۚ۠ۢۥۨۘۧۘۧۘ";
                                break;
                            case -7179689:
                                str = "۫ۘۨۘۢۚۨۘ۠ۦ۠ۙۗۗ۠ۤۨۚۙ۬ۤۗۦۗ۠ۜۛۦۨۧۖۦۙ۬ۜۘۙۧۤۦ۟ۥ۫ۙۨۘۚ۬ۘۘ۠ۘۘ";
                                break;
                        }
                    }
                    str = "ۨۗۡۦۖۨۘ۬ۜ۬۠ۚۚۙۚ۟ۖ۟ۨۘۖۥۡۛۛۜۘ۟۬۬۠۬ۥۛۗۖۘۤۛۛۚۨۘۛۗۚۧ۬ۗۚۤۡۖۥۦۘۛۧۥۘ";
                    break;
                case -1198960393:
                    str = "۬۠ۛۧ۬ۦۡۡۧۘ۫ۨۘۚۨۖۘۥۧۘۖ۫ۦۘۥۡۜۥۘۤۖۗۦۖۖۗۘۖ۬ۤۤۦۖۖۜ";
                    break;
                case -1118130922:
                    return z3;
                case -937953244:
                    String str6 = "ۚۛۖۘۥ۠ۘۚۢۖۛ۬ۜۘۜۖۧۛۢۖ۫ۦۘ۟ۚ۟ۖ۟ۘۘ۫۠ۗۦۜۜۚۛۗ";
                    while (true) {
                        switch (str6.hashCode() ^ 1026454901) {
                            case -1827294742:
                                String str7 = "۫۫ۡۛۡۚۙۥۘۜۜۙۨ۠ۥۖۧۜۘ۬۬ۧ۫۫ۘۦۡۘۘۡۨۜۖۙ۟۟ۧۥۘ";
                                while (true) {
                                    switch (str7.hashCode() ^ (-289212535)) {
                                        case -1426353597:
                                            str6 = "ۜۥ۬ۦۜۜۘ۠ۗۡۗۥۦۖۦۦۦۨۦ۬ۙۛۨۘۘۢۢۤۥ۠ۦۘۗۢۛۢۚۤۥۘ۟۬ۢۗۙۧۘۘۨۡۧۨ۠ۘۗ۬";
                                            break;
                                        case -367394719:
                                            str7 = baseListView.getScrollY() > 0 ? "ۚۖۦۘ۫ۙۜۘۖۜۥۚ۟ۡۛۢۙۘۧۖۤۡۘۗ۬ۘۘۙ۟ۥۘ۟ۢۘ۫ۖۜ۟۠ۘ" : "ۛ۫ۥۘۥۦ۫ۡ۫ۜۘۖ۠ۡۡۖۙۗۥۚۧۨۘۤۜۛۧۛۜۘۛۖ۠ۗۜۤۥ۫ۜۘ";
                                            break;
                                        case 222960527:
                                            str6 = "ۡۛۧۥ۬ۗ۠ۥۨۘۧۗۢۡۛۘۘۜۡۧۤۢۖۘۖۚۜۘۧۘۨۘۚ";
                                            break;
                                        case 544423893:
                                            str7 = "ۨۡۡۘۗۖۖ۫ۗۛ۠ۤۦۘۖۛۡۘۤۦۨۘۛ۬ۥۘ۫ۘ۟ۤۙۘ۟۠ۥۖۨۦۢ۠ۘۗۚۧۨۜۧۨ۫ۘ۬ۡۘ";
                                            break;
                                    }
                                }
                                break;
                            case -583872263:
                                str = "۬۠ۤ۟ۚۨ۠ۖۨۘۚۘۚ۠ۛۢۦۨۘ۟۬ۡ۫ۡۨۦ۫ۥۚ۫۬۬۫ۜۜۖۨۘۚ۟ۙۨۙۛۘۜۨۢۗ۬";
                                continue;
                            case 936378686:
                                str6 = "ۘۤۦۘۥ۬۫۫۠۬ۨۧۖۘۘۤۚ۬ۡۥۘۤۨۜ۫ۗ۬ۙۘۘۘۘ۠ۧۘۧ۠۫ۢۡۥ۠ۨۦۦ۫";
                                break;
                            case 1566451966:
                                str = "ۧۢۥۘۜ۬ۡۘۜۤۧۛۤۨۘ۠ۖۡ۫ۛۜ۟۠ۥۜ۬ۡۘۜۖۛۧ۠ۤ";
                                continue;
                        }
                    }
                    break;
                case -299631451:
                    str = "ۨۦۖۘۘۛ۠ۡۤۥۘۖۨۨۡ۫ۦۧ۠ۖۘۛۤۜۘ۬ۜۛۤ۫ۘۜ۟ۢۚۧۡ۬ۦۜۘ";
                    z4 = true;
                    break;
                case 425721856:
                    str = "ۧ۬ۨۘۗۙۥۘۡ۬ۡۚۚۜۘ۟ۗۜۘۦۘۢ۠ۧۖۗۧۘ۟ۧ۠ۢ۠ۥۘۦ۬۬ۨ۫ۗۨۚۤۖۜۙۧۥۘۢۥۚ۫ۗۨۘ۬ۧۧ";
                    break;
                case 518978354:
                    return ViewCompat.canScrollVertically(this.OoooOoO, -1);
                case 778916809:
                    str = "ۗۖۛۧۖۦۘۥۥۖۙ۬۬ۛۛۡۘ۫ۢۢۚۚۖۖۙۡۘ۫ۚۥۘ۫ۛ۠۫۬ۦۘ۬ۘۤۧۗۘۘۧۤۛۦ۠ۧۘۙ۬";
                    z = z5;
                    break;
                case 953204259:
                    String str8 = "ۤۖ۫۬ۡ۬ۜ۫ۛۡ۬ۧۥ۠۫ۜ۠ۢۡۖۘۢۢ۠ۗۨۨۡۢۢۦۨ۠ۦۘ۫ۥ۬ۖۘۡۚ۠ۜۗۚۜ۬ۜۜ۟۟ۢۛۖۘ";
                    while (true) {
                        switch (str8.hashCode() ^ 1618316997) {
                            case -1145703459:
                                str = "ۤۨ۟ۙ۬ۤۢۧۡۢۧۡۧۛۚۛ۠ۦۘۛۡۨۘ۠ۛ۬ۖۥۘ۫ۥ۫ۙۨۥ۠ۢۘۘۘۨۛۖۚۥۘۛ۬ۛۛۨ۬";
                                continue;
                            case -358834545:
                                String str9 = "ۢۤۜۘۘۜۡۥ۫ۥۘۘۖۗۡۘۡۘۛۖ۠ۥۨ۬ۜۘۗۦۖۘۥۧۡۘ۬۬ۨۘۙۜۡۘۧۜ۠۬ۧۖۜۚۦۨ۫ۤۨۨ۬ۙۥ۟";
                                while (true) {
                                    switch (str9.hashCode() ^ 1399450853) {
                                        case -1839853866:
                                            str9 = Build.VERSION.SDK_INT < 14 ? "ۚۤۖۦ۟ۨ۟ۥۘ۟۬ۙ۫ۗۥۘ۫۫ۢۙۚۥۜۘۥۘۖۗۧۥۜۘۘ" : "ۙۛۨۚۖۘۘ۠ۛ۟۠ۥۡۘۨۤۙ۫ۨۙۦۘۡ۟ۖ۠۠ۙ۬۫ۨ۟ۦۧۗۥۨۛۜۚۜۨۢۥۡۤۡۦۘ۟";
                                            break;
                                        case -1347276485:
                                            str8 = "۫ۜۧۥۧۘۡ۫ۜ۫ۙ۟ۘۗۚۛۨۘۡۥۚۚۤۙ۬ۙۗۡۖ";
                                            break;
                                        case 13250421:
                                            str9 = "ۤۡۡ۟ۜۘۘ۬۫ۜۘۡۨۢۤۛ۫۠۠۠ۘۛۧ۠ۛۦۧ۬ۧۗۙۖۙۙۖۛۥۚ";
                                            break;
                                        case 704658337:
                                            str8 = "ۘ۟ۜۛۢۘۢۜ۟ۜۥ۬ۧۦۦۘ۠ۤۗۥۥۧۘۡۖۡۗ۟ۚ۠ۜۘۦ۫ۦۧۜۗ";
                                            break;
                                    }
                                }
                                break;
                            case 174738290:
                                str8 = "ۖۦۡۘۜ۠۫ۤۡۖۗۢ۫ۚ۬ۜۘۥ۟ۛۖۨۥۘۦۜۖۘۤ۟ۨۤۗۖۢ۠۟ۛ۫۠ۛۥۛۨۙ۬";
                                break;
                            case 592466651:
                                str = "ۖۗ۠ۙۘۗ۫۬ۡۘۖۦ۬ۙۨۘۡۧۢۢۛۦۨۨۖۡۜۜۘۚۖۤ";
                                continue;
                        }
                    }
                    break;
                case 1054614830:
                    String str10 = "۟ۨۡۘۘۖۤۜۨۥۤۜۨ۟ۙۤۗۧۤۨ۬ۜۘۚۤۥۘۖۡۧۡۛ۠ۙۘۖۤۨۘۘۧۡۤ۠ۜ۬ۦۤۤۖ۬ۥ";
                    while (true) {
                        switch (str10.hashCode() ^ 157027164) {
                            case -1705189734:
                                str10 = "ۧۙۥ۫ۧۛۨ۬ۜۙۢۘۚ۬ۘۙۚۧ۬۟۫ۛۦۘۚۦۡۘۨۥ۫ۧۘ۬ۚۜۗۧۦ۬ۦۥۤ";
                                break;
                            case -1043911068:
                                break;
                            case -606104903:
                                str = "ۡۦۨۛۛۛۙۗۤۖۡۘۜۚۛۤۛ۬ۙۧۙۘ۬۬ۜۥۚۜۜۗۜۢۖۘ۫۟ۢ";
                                break;
                            case 2105685152:
                                String str11 = "ۡ۠ۦۘ۫ۜۡۡۚۢ۫ۥۦۤۥۘ۟۠ۖۢۡۘۚۜۦۘ۟۫ۗۗۡۢ";
                                while (true) {
                                    switch (str11.hashCode() ^ (-1050775040)) {
                                        case -1048243494:
                                            str11 = baseListView.getFirstVisiblePosition() <= 0 ? "ۧۘ۟ۨۛۧ۫ۜ۟۟ۤۦۘ۟۟ۖۘ۬ۡۦۘ۟۠ۨۢ۫ۜۘۖ۬۫ۙۥۘ" : "ۜۚۨۘ۠ۙۡ۬۬ۥۢ۠ۦۛۦۥ۬ۜۖۘۗۡۘۘۗ۫ۨۘۢۨۦۦۨۗ۫۠ۖۘۤۤۘۜ۠ۧۦۢۗۗۢ۬۫ۧۚ";
                                            break;
                                        case 286331094:
                                            str10 = "ۦ۬ۙۜۢ۟ۥ۬ۢۨ۫ۡۨۨۖۦۧۜ۠ۛۛۘۚ۟ۡۡ۠ۨۥۘ۠ۥۡۤۤۜ";
                                            break;
                                        case 456660475:
                                            str11 = "ۧ۬ۨۜۦۖۘۘ۟ۡۙ۫ۡۘ۠۟ۖۥۖۡۘۨۦۥۗۘۧۘۜۜۘ۠۠۠";
                                            break;
                                        case 1276008708:
                                            str10 = "ۤۦۤۢ۠ۘۘۗۚ۠ۗ۟۠ۤۡۤ۫ۚۜ۫ۗۜۧۧۤۘۦۙۤۚۜۘۥ۬ۖۤۚۘۘ۟ۜۜۘۡۧۜۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1250813229:
                    String str12 = "ۚۨۤۘۦۘۦ۫ۙۚۖۘ۟ۤۦۘۜۡۢ۠ۧۖۘۨۛۖۘۛۨۘۘۥۡ۬ۖۡۦ۬ۗۛ۠ۖ۫۟ۥ۫ۦۗۢ۫ۥۧۘ";
                    while (true) {
                        switch (str12.hashCode() ^ (-96850525)) {
                            case -1298658575:
                                str12 = "۠ۜۘۚۦۤۡۗۙ۬ۚۢۤۜۗ۠۬ۙ۠ۛۦ۫ۚۨۙۧۦۥۘ۫ۛۜۘۜۗۖ۟ۥۦ۬ۚ۟";
                                break;
                            case -193975567:
                                break;
                            case 1135686845:
                                str = "ۖۗ۫ۦ۫ۡ۫۫ۖۘۧ۟ۛۖۥۦ۠ۖۧۦۘۘۘ۠ۥۥۘ۟ۥۡۘۘ۫ۙۜۖۘۢۜۚ";
                                break;
                            case 2094724127:
                                String str13 = "۠۬ۦۦۥۜۘۨۨۨۘۜۧۡۘۚۙۡۘۗ۬ۖۘۧ۬ۦۙۙۡۘۜ۠۟ۦۜۘۘ۬ۖۧۘۚۚۘۖۥۧۘۛۨۘۧۙۥۘۢۥۤ";
                                while (true) {
                                    switch (str13.hashCode() ^ (-734624349)) {
                                        case -1074282174:
                                            str13 = baseListView.getChildCount() > 0 ? "ۙۚۥۗ۬ۗۡۡۜۘۙۡۖۘۜۙۤۚ۟ۛۨۗۖۘ۬ۥۨۘۨۥ۠ۢۥۦۡۘۘۨۨۨۘۤۦۧۘۧ۬ۥۡۖ۫ۦۢۖۘ" : "ۢۥۥۘۗۧۜ۠ۘۗۡۧۥ۟ۚۡۧۛ۬ۚۛۥۘۤۥۡۨۛۚۦۦ۫ۖۨۥ۬ۙۗۦۚۧۧۘ۠ۛۤ۟ۙۡۛۖۜ۠ۨۘ";
                                            break;
                                        case 1437808774:
                                            str12 = "ۗۧۖۗۥ۠ۡۦۥ۬ۚ۟ۚ۫ۥۘۛ۫ۚ۟۫ۖۗ۫ۨۘۘۨۚ۫ۡۛ۬ۗۨۘۧ۠۫ۚۨۖۜ۫ۦۘۡۖۥۘۧۚۙ۟ۚۨۘۚۘۧ";
                                            break;
                                        case 1628126024:
                                            str13 = "ۢۧۡۘۚ۫۬ۡۨ۠ۥۤۖۘ۫ۘۢۘۡۢ۠ۙۘۡۥۨۘۥۛۨۛۧۦۘۢۡۖۤۛۛۖۢۜۘۗۤۢۗۗۧۥۨۥ۠ۜۘۘۤۜۘ";
                                            break;
                                        case 1714014577:
                                            str12 = "۬ۖۜۖۙۜۗۦ۠ۖۜۛ۬ۡۤۡۛۖۘۨۤۨ۟ۗۘۚۧ۟ۛ۬ۗ۟ۧۘۘۦ۟ۛ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1284843073:
                    str = "ۥۖۖۦۥۨۘ۟۫ۢۗۤۥۘۖ۬ۦۜۨۛۛۖۦ۫۬ۧۙ۠ۖۘۗۘۥۢۦۘۙۖ۠ۚۥۜۨ۠ۧۛ۠ۜۘۨۡۘۧ۫ۦۘ۠ۙۚ";
                    break;
                case 1377081660:
                    str = "ۥۤۘ۫ۘۦۡۜۥۘۨۨۨۥ۠۠ۗ۠ۨۧۤۛۨ۬ۜۧۨۥ۫ۖۜ";
                    z3 = z4;
                    break;
                case 1512086657:
                    return z;
                case 1663520208:
                    str = "ۦۜۦۘۘۖۘۤۢۡۘ۬۠ۦۘۨۖۤۦۗۥۘۥ۟ۤ۟ۜۡۖۘۦ۟ۘۘۥۤۗ۠ۘۧۘۖۡۢۡۤ۬ۤۢۨۘ۠ۨ۬ۡ۬ۘۖۥۡۘ";
                    z3 = false;
                    break;
                case 1825507858:
                    str = "ۖۗ۠ۙ۟ۢ۟ۥۡۢۦۨۘۗ۫۠۫ۤۜۤۥ۟ۢ۫ۗۖۦۧ۬ۡۚۜۗۨۤۡۘ۬ۥ۬ۗۤۦ";
                    break;
                case 1891206851:
                    baseListView = this.OoooOoO;
                    str = "ۙۗ۬۫ۨۤۜۥۙ۠ۢ۫ۙۖۤ۫ۖۧۘ۫ۥۢ۫ۛ۫ۜ۬ۥۡۚ۠ۜۤۨۘۛۘۜۦۗۨۘۢۚ۫";
                    break;
                case 2091754147:
                    str = "ۦۜۦۘۘۖۘۤۢۡۘ۬۠ۦۘۨۖۤۦۗۥۘۥ۟ۤ۟ۜۡۖۘۦ۟ۘۘۥۤۗ۠ۘۧۘۖۡۢۡۤ۬ۤۢۨۘ۠ۨ۬ۡ۬ۘۖۥۡۘ";
                    break;
            }
        }
    }
}
